tests/results-soak.txt
Test run id: tejdk_ektcqbbkpqgpwmpjaqfjq54tmkq9j_bwb6
Phase started: unnamed (index: 0, duration: 120s) 00:12:51(-0500)

--------------------------------------
Metrics for period to: 00:13:00(-0500) (width: 8.057s)
--------------------------------------

http.codes.200: ................................................................ 241
http.downloaded_bytes: ......................................................... 19039
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 241
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 52
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 16
  p99: ......................................................................... 36.2
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 52
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 16
  p99: ......................................................................... 36.2
http.responses: ................................................................ 241
vusers.completed: .............................................................. 241
vusers.created: ................................................................ 241
vusers.created_by_name.0: ...................................................... 241
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 64.6
  mean: ........................................................................ 9.2
  median: ...................................................................... 6.6
  p95: ......................................................................... 20.7
  p99: ......................................................................... 41.7


--------------------------------------
Metrics for period to: 00:13:10(-0500) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 31
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 31
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 12.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 33.5
  mean: ........................................................................ 6.2
  median: ...................................................................... 5.5
  p95: ......................................................................... 11.6
  p99: ......................................................................... 16.3


--------------------------------------
Metrics for period to: 00:13:20(-0500) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 30
  mean: ........................................................................ 4.7
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 13.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 30
  mean: ........................................................................ 4.7
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 13.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 33.3
  mean: ........................................................................ 6.9
  median: ...................................................................... 5.8
  p95: ......................................................................... 12.8
  p99: ......................................................................... 19.1


--------------------------------------
Metrics for period to: 00:13:30(-0500) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 85
  mean: ........................................................................ 10.6
  median: ...................................................................... 4
  p95: ......................................................................... 56.3
  p99: ......................................................................... 71.5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 85
  mean: ........................................................................ 10.6
  median: ...................................................................... 4
  p95: ......................................................................... 56.3
  p99: ......................................................................... 71.5
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 692.6
  mean: ........................................................................ 29.2
  median: ...................................................................... 6.6
  p95: ......................................................................... 96.6
  p99: ......................................................................... 528.6


--------------------------------------
Metrics for period to: 00:13:40(-0500) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 86
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 15
  p99: ......................................................................... 40.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 86
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 15
  p99: ......................................................................... 40.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 102.6
  mean: ........................................................................ 8.3
  median: ...................................................................... 5.8
  p95: ......................................................................... 19.9
  p99: ......................................................................... 48.9


--------------------------------------
Metrics for period to: 00:13:50(-0500) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 834
  mean: ........................................................................ 33.3
  median: ...................................................................... 4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 658.6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 834
  mean: ........................................................................ 33.3
  median: ...................................................................... 4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 658.6
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.2
  max: ......................................................................... 845
  mean: ........................................................................ 39.1
  median: ...................................................................... 6.5
  p95: ......................................................................... 257.3
  p99: ......................................................................... 699.4


--------------------------------------
Metrics for period to: 00:14:00(-0500) (width: 9.949s)
--------------------------------------

http.codes.200: ................................................................ 298
http.downloaded_bytes: ......................................................... 23542
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 965
  mean: ........................................................................ 14.9
  median: ...................................................................... 4
  p95: ......................................................................... 55.2
  p99: ......................................................................... 98.5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 965
  mean: ........................................................................ 14.9
  median: ...................................................................... 4
  p95: ......................................................................... 55.2
  p99: ......................................................................... 98.5
http.responses: ................................................................ 298
vusers.completed: .............................................................. 298
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 1041.8
  mean: ........................................................................ 32.2
  median: ...................................................................... 6.6
  p95: ......................................................................... 111.1
  p99: ......................................................................... 925.4


--------------------------------------
Metrics for period to: 00:14:10(-0500) (width: 9.989s)
--------------------------------------

http.codes.200: ................................................................ 302
http.downloaded_bytes: ......................................................... 23858
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 38
  mean: ........................................................................ 3.4
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 19.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 38
  mean: ........................................................................ 3.4
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 19.1
http.responses: ................................................................ 302
vusers.completed: .............................................................. 302
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 44.6
  mean: ........................................................................ 5.6
  median: ...................................................................... 4.7
  p95: ......................................................................... 9.3
  p99: ......................................................................... 21.1


--------------------------------------
Metrics for period to: 00:14:20(-0500) (width: 9.951s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 64
  mean: ........................................................................ 4.5
  median: ...................................................................... 3
  p95: ......................................................................... 12.1
  p99: ......................................................................... 44.3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 64
  mean: ........................................................................ 4.5
  median: ...................................................................... 3
  p95: ......................................................................... 12.1
  p99: ......................................................................... 44.3
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 80.5
  mean: ........................................................................ 6.9
  median: ...................................................................... 5.3
  p95: ......................................................................... 14.7
  p99: ......................................................................... 47


--------------------------------------
Metrics for period to: 00:14:30(-0500) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 145
  mean: ........................................................................ 11.7
  median: ...................................................................... 4
  p95: ......................................................................... 64.7
  p99: ......................................................................... 108.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 145
  mean: ........................................................................ 11.7
  median: ...................................................................... 4
  p95: ......................................................................... 64.7
  p99: ......................................................................... 108.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 195.3
  mean: ........................................................................ 17
  median: ...................................................................... 5.9
  p95: ......................................................................... 96.6
  p99: ......................................................................... 159.2


--------------------------------------
Metrics for period to: 00:14:40(-0500) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 143
  mean: ........................................................................ 6.1
  median: ...................................................................... 3
  p95: ......................................................................... 15
  p99: ......................................................................... 94.6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 143
  mean: ........................................................................ 6.1
  median: ...................................................................... 3
  p95: ......................................................................... 15
  p99: ......................................................................... 94.6
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 169.9
  mean: ........................................................................ 10.4
  median: ...................................................................... 4.7
  p95: ......................................................................... 46.1
  p99: ......................................................................... 117.9


Phase completed: unnamed (index: 0, duration: 120s) 00:14:51(-0500)

--------------------------------------
Metrics for period to: 00:14:50(-0500) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 23700
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 278
  mean: ........................................................................ 9.7
  median: ...................................................................... 3
  p95: ......................................................................... 25.8
  p99: ......................................................................... 219.2
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 278
  mean: ........................................................................ 9.7
  median: ...................................................................... 3
  p95: ......................................................................... 25.8
  p99: ......................................................................... 219.2
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 287.4
  mean: ........................................................................ 14.4
  median: ...................................................................... 5.6
  p95: ......................................................................... 56.3
  p99: ......................................................................... 237.5


--------------------------------------
Metrics for period to: 00:15:00(-0500) (width: 2.006s)
--------------------------------------

http.codes.200: ................................................................ 59
http.downloaded_bytes: ......................................................... 4661
http.request_rate: ............................................................. 36/sec
http.requests: ................................................................. 59
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 37
  mean: ........................................................................ 4.3
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 10.9
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 37
  mean: ........................................................................ 4.3
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 10.9
http.responses: ................................................................ 59
vusers.completed: .............................................................. 59
vusers.created: ................................................................ 59
vusers.created_by_name.0: ...................................................... 59
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 39.3
  mean: ........................................................................ 6.2
  median: ...................................................................... 5.3
  p95: ......................................................................... 10.5
  p99: ......................................................................... 12.8


All VUs finished. Total time: 2 minutes, 2 seconds

--------------------------------
Summary report @ 00:14:54(-0500)
--------------------------------

http.codes.200: ................................................................ 3600
http.downloaded_bytes: ......................................................... 284400
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 3600
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 965
  mean: ........................................................................ 9.5
  median: ...................................................................... 4
  p95: ......................................................................... 27.9
  p99: ......................................................................... 96.6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 965
  mean: ........................................................................ 9.5
  median: ...................................................................... 4
  p95: ......................................................................... 27.9
  p99: ......................................................................... 96.6
http.responses: ................................................................ 3600
vusers.completed: .............................................................. 3600
vusers.created: ................................................................ 3600
vusers.created_by_name.0: ...................................................... 3600
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 1041.8
  mean: ........................................................................ 15.4
  median: ...................................................................... 5.8
  p95: ......................................................................... 42.5
  p99: ......................................................................... 232.8